{
    "articles": {
        "title": "Articles",
        "type": "array",
        "thumbnail": "elena_thumb.jpg",
        "items": [{
            "title": "Elena Adeniyi",
            "header": "Inside the mind of Brisbane photographer and designer Elena Adeniyi and her creative inspirations.",
            "body": "*ielenaAdeniyiOffice*pElena Adeniyi is a Brisbane photographer and designer on her way to becoming a household name within the creative community. Inspired by her Nigerian background, she continues to tell stories about her roots, through not only her photography, but also through her clothing brand, Sieko Tribe.\n\nWe sat down with her to talk about what fuels her creatively, how she deals with the challenges of being a creative, and what's next for her.*q\n\n\nCould you introduce yourself for people that don’t know you?\n*pHey, my name is Elena Adeniyi, I usually go by Oluwa, I’m a photographer and designer, I have a clothing brand called Siéko Tribe and a styling alias called Siéko Studios.\n\n\n*qWhere are we, could you give us a rundown on this space?\n*pRight now we’re in my house, this is my room. This is where I usually create, where I edit my photos and come up with my ideas. This is my mood board, these are some of my samples I have for my brand. But yeh, mainly when I’m here, I’ll just be chilling, researching stuff like fashion shows and watching YouTube videos about fashion designers. This is my safe space and basically where I get most of my work done.*iwhiteboard*q\n\n\nWhat caused you to pick up a camera and start taking photos?\n*pI first started in grade 10. I used to do photography as a subject in high school, and then I was like oh, I like photography and fashion, let me see how it goes. I got my first camera for Christmas, shout out mum, and then from there I just started taking photos. I took a lot of landscape photos, so like plants, flowers, butterflies, and I was really interested in that. Over the years I gradually changed into taking a lot more portrait photos, and then now more recently I really enjoy fashion editorial photos and photos of my friends and family.*icamera*q\nHow has your personal life, whether it be childhood or now, influenced the way you create and your style?\n*pI kind of grew up in a creative household, I have two older siblings, they are much older, like 6-7 years, and they were always into music and fashion. My brother is a stylist, he has his own clothing brand as well, and my sister does graphic design and photography too. So I think growing up under their wing definitely influenced me and how I perceive fashion and how I’m introduced to things. Even my cousin, I’m wearing a piece from his clothing brand Nomen, so it’s kind of in our family blood. Growing up I was surrounded by a lot of creative people, and I think because of that I’ve been able to get into this industry.*q\n\n\nI know you’ve said that Tyler Mitchell is your favourite photographer, but are there any other creatives that have inspired you or helped you find your style?\n*pOh 100%, a lot of Nigerian creatives, the Nigerian creative industry right now is going crazy. There’s Olaolu Slawn, there’s Mowalola, she’s a fashion designer, Isabel Okoro, she’s a photographer as well. People like that, when they put out their work, I can relate to their stuff and it has heavily inspired me and how I put out my work. I think the way they’re handling the industry right now is just amazing, and yeh I definitely want to be in that space.\n\n*isitting*qYou have a photo series where you photograph your friends doing what they love, how important is it for you to surround yourself with people of all different creative avenues?*p\nI just think I have the most talented friends, even if they aren’t putting out stuff, they are doing things that I’m like, wow this is insane. For that photo series I wanted to showcase them, because they haven’t really been shown in that light before, whether they’re skaters or into music, they’re all crazy talented. Even with the yoga people, that’s their own talent and that’s them showing their light and I just think it’s so important to surround yourself with creative people. I wanna help them come up in this industry because I think it’s all about, if I’m coming up, I want you to come up with me.*q\n\n\nWhat is your creative process from the idea being born, to the photo/piece being completed?*p\nFor the photos, I’ll just be on instagram or Pinterest, and I’ll see something I like, I’ll make a mood board, then I reach out to a makeup artist, or find a studio space or location where I can shoot, find a model, and then from there, do the shoot, come back home, chill a bit, then edit the photos, and then put it out. I like to put it on my website as well as instagram.\n\nSame with the clothes, sometimes even in the middle of the night i’ll just wake up and be like, oh my god, this would be so cool, sketch it out then go back to bed. When I wake up again, I reach out to my embroiderer, who helps me do the embroidery work and bring my ideas to life. We’ll go back and forth with ideas, and then we make samples, sometimes the samples are good sometimes they are bad, if they're bad, go back to the drawing board and try again, and then eventually do the shoot and put out the work.\n\n*isiekoTribeSketch*q\nI know a lot of artists face creative blocks, self-doubt, or are sometimes just unmotivated, how do you fight that mentality?*p\nTo be honest, I just talk to my friends or family about it, because I do face a lot of creative blocks. During covid there was a time where I was wasn’t sure if this is what I wanted to do anymore, and then I spoke to some friends and went back and thought to myself, am I doing this because I might gain more followers, or am I doing this because it’s something I genuinely like, and I think in situations like that, when you know it’s something you are genuinely interested in, it’s fine if you have a creative block or are unmotivated, just along as you are 100% into it and put all your energy into making it work.*q\n\n\nYou’ve had a solo exhibition, How did we get here, and recently have had photos on display at the BSA fest. How important is it to you for your work to be printed and shown to the public in a physical form?*p\nI think it's really important, I’d been wanting to do something like that for a long time, it was one of my goals and when I was able to tick that off, I felt like I was on the right track to becoming a photographer. That exhibition, even just coming up with ideas or different locations, I couldn't believe it was happening and on the night, when I gave my speech, I was crying a bit just because I was so overwhelmed with the fact that people where there to support me. Even being selected to be apart of BSAF, it meant people are seeing my work, recognising it and actually acknowledging that my stuff is actually pretty good. Knowing that people like what you’re doing and that they’re paying money to come to your exhibitions, I think that’s very important as a photographer just to grow.\n\n*isweetTalkElenaAdeniyi*q\nIn your recent photo series, the lost brothers, you talked about the stigma of mental health and checking up on your brothers. How important is it for you to tell a story with everything you do, whether it be a photo series or a clothing piece?*q\nWith the lost brothers, I had to do an exhibition about mental health, and I realised that a lot of my male friends weren’t as open to sharing about their mental health issues because of the stigma that guy’s should be stronger and that they shouldn't share. The photos I took were of my closest’s friends and I just wanted to showcase that it’s okay to express your thoughts and feelings and if you're not feeling okay, share that with us. I feel like that was a very strong message that I could convey with my photos. As much as I love doing fashion editorial photos, I also love to dive deep into some of the issues people face and trying to showcase them through my photos.*q\n\n\nCreative expression can take many forms, what caused you to go with fashion and start Siéko Tribe?*p\nWell first of all, the name itself comes from Éko which is basically another name for Lagos, which is where I’m from in Nigeria. I wanted it to be like look at Lagos, look at Nigeria, and see what it's about to become. A lot of my clothing items are named after Nigerian things, or Yorúba words, which is my native language. A lot of the clothes that I make are a connection between those two pieces, my love for fashion, and my Nigerian roots. I still know I have a long way to go with brand. I definitely want to drop a lot more pieces and to continue to showcase the story behind my brand.\n\n\n*icaps*qWith new fashion brands being made everyday, what is it that separates Siéko Tribe from the rest?*p\nI think the main thing that separates us from everyone else is that my brand’s purpose is to represent my heritage, and where I come from. Not to throw any shade, or dis them, but a lot of these brands, they just slap a logo on a hoodie without any meaning and put that out. And that's great for them, there’s nothing wrong with that if that’s what you like. But I feel like with my brand, I actually know that I’m representing my culture and showcasing where I'm coming from and telling the story with that.*q\n\n\n5 years from now, what do you wish to have achieved with Siéko Tribe and your photography?*p\nFive years from now. I definitely want it to be more known. I would love to have it in a store. That's definitely it. I feel like with my brand and my photography, at the moment I want my photography to be my main passion, you know how rappers have their music, and then on the side, they have a brand. I kind of want to do something like that. I would love to have a run way, it doesn't have to be a crazy big one. Maybe down the line collaborate with artists and they can have their pieces in their music videos, I think that would be really cool. And then with my photography as well, I'd love to work for ID. That's why I did the journalism degree so I can get there someday. I would also love to do a shoot for Double Double, that’s my favourite brand. But I’m not sure what the future holds so I guess we’ll see.\n\n*isiekoTribe*q\nYou run a clothing brand, have had your photos in exhibitions, have been featured in many publications, and much more, what have you done that you are most proud of?\n*pDefinitely my ID feature. Two things I really wanted to do last year was have an exhibition, and I wanted to be featured in ID by the end of the year, and luckily I was able to do both, thank God for that. I had been submitting my photos to ID for a long time, at one point, I said to myself this is the last time I submit my photo, if it doesn't work out, it doesn't work out. Luckily, they selected that last photo. That was a big moment for me and I thought to myself, I'm definitely on the right track. ID are one of my favourite magazines, I'd love to work there one day. So definitely that and the exhibition, those are my two.*q\n\n\nWhat other Brisbane-based creatives do you think are pushing the boundaries and deserve to be recognised?*p\nThis is going to be a long one. First off, my friend Tre, he has his brand Jouer Autre. He's dropping it next month, he showed me some of his sample work and it's so incredible. The way he puts these pieces together, people definitely need to check him out. My other friend David, he's a film photographer, his work is really incredible and he’s been coming up over the past years. I have a lot of friends in music as well. Like Ben and Yeremih, their work is insane and even though they’re underground, you’d think they are big artists when you hear their music. Even my friends that are skating like Taban, Troy, Riley, just so many people. I can't really shout them all out, but just a lot of people in my circle are so insanely talented. So shout out to everyone.\n\n\n*qWhat advice do you have to young creatives who are just getting started, regardless of their medium?\n*pDefinitely to just put stuff out there. Even if it’s shit, even if it just doesn't make sense, just put it out. Keep pushing, keep getting better because even with me and my brand, the first few jobs I did they were not good. I'm not gonna lie, looking back now. They're not good, but I'm glad I put it out there so I could continue to grow. Even with my photos, my first few photos, were just so mid and I just removed them from my Instagram. If you keep waiting to put up the perfect one, it won’t come, there never really is a perfect photo or perfect piece of clothing. You just have to continue to grow and just chase your dreams. Stay in school as well.\n\n*isiekoTribeSweetTalk*q\nIf you could have a dinner party with any 5 people (dead or alive) who would they be and why?\n*pKanye West for sure. Amine as well because they're my two favourite artists. This is hard hahah. So many people I would want to have. Definitely Virgil Abloh as well, RIP Virgil. I feel like that I haven't mentioned any girls as well.'d have to have my mom there because she'd be fun to add to. The last one would have to be my brother, he loves all the other artists as well. I feel like that would be a good combination. But definitely Kanye West, i love him to bits. And then Virgil because obviously he’s an icon.\n\n\n*qIs there anything else you want to say? What’s next for you?\n*pI’m planning on moving to Melbourne in a couple of months, just for a bit. We’ll see how that goes. I definitely want to work with as many creatives as possible and just continue to get better at what I'm doing. I also want to do a lot more drops for Siéko Tribe, might do a show or a pop-up you never know. I’m definitely just looking forward to the future and what it holds, but yeh, that’s me.\n\n*fPhotography credit: Oliver Nijimbere\n\n\n*fContinue to support and be inspired by creatives all around Australia at Sweet Talk, and if you want to see more content from the people that brought you this interview, check out Candy .\n",
            "author": "Gabriel Mungarietta",
            "date": "2022-05-30T00:00:00.000Z"
        }, {
            "title": "Whobokku",
            "header": "Inside the mind of Brisbane artist and skater Whobokku and his creative inspirations.",
            "thumbnail": "whobokku_thumb.jpg",
            "body": "Andrew Krasnoff, otherwise known as Whobokku, is a Brisbane artist and skater who continues to forge a path for other creatives with his unique artwork. Inspired by his background in skating and music, his style and paintings are refreshingly unique and provide a glimpse into what fuels him creatively.\n\nWe sat down with him to talk about his creative inspirations, his process when making his art pieces, and his advice for other artists like himself. \n\n\nCould you introduce yourself for people that don’t know you?\nMy name is Andrew Krasnoff, I paint, I do my creative endeavors as Whobokku or Bokku, and I’m a 29 year old Brisbane creative.\n\n\nWhere are we, could you give us a rundown on this space?\n*pWe're in the basement underneath my house in Herston, Queensland, this is where I do all my aerosol stuff, do a lot of my creative work, and yeh just keep all my shit.\n\nWhobokku BasementYour style is super unique, how has your personal life influenced your style and the way you create?\nYeah, I think it completely influences and shapes it, as everything else in life does. I definitely think that all my experiences shape my art. I feel like art for me, gives me the chance to say the things that I can't say in person or that I struggle to with words, and instead I can show it through my art.\n\nIs there a particular time or place where you feel most creative?\nAh shit. It's diverse. It changes all the time. Like whatever is happening in that moment in my life, it could be like in the morning, I'll wake up feeling good and ready to go, but other times late at night. Yeah, just changes whenever the feelings there.\n\nYour style has evolved a lot over the past couple of years, do you think your art reflects what you are feeling at that point in your life?\nYeah, definitely. It's like a little snapshot into what was happening in my life when I made it. You can look back and kind of get a hit of nostalgia too. I see them as like little mementos.\n\nWhobokku aerosolFrom when the concept first enters your mind, to the finished product, what is your creative process?\nSo recently, it's been mostly sketching, I'll try to sketch a character or an idea out and then sometimes I'll just try to smash out the painting in that session and just go straight to filling in with colour. And then aerosol after, but it can be collaging too so like, chopping out bits from one piece, and then sticking it on another painting I've been doing in the past. My process changes a lot as well, it's a big mixed bag. I feel like that’s just me though, I get distracted a lot and my attention span is pretty thin on certain things. Sometimes I will smash into something for like 12 hours a day, and then just be like kind of over it, and then just move onto the next thing.\n\n\nI know a lot of artists face creative blocks, self-doubt, or are sometimes just unmotivated, how do you fight that mentality?\nJust life I guess, I like to get out, do other stuff, just really balance it out. Finding a balance in life is really important, in whatever you do. Skateboarding helps me a lot, having that creative outlet, and then art as well, it's a nice little marriage.\n\nWhobokku Art\nWhat impact do you want your artwork to have on the people that see them?\nDamn, that's a hard one. What I find value in when I see art is that something's being said that I relate too. It's like showing that something's okay. Showing me that it's okay to have these feelings or showing me that, alright, this person also experienced this. Maybe give people some clarity on some feelings or thoughts that they’ve been having that they can see in my art. I don't know. It's just showing things that they can relate to I guess.\n\n\nYou have had public exhibitions of your work before, you have a book full of photos and your artwork. How important is it to you for your work to be printed and shown to the public in a physical form, in comparison to just seeing it on instagram?\nYeah for sure. Well I guess I use mostly practical stuff, so I already get the piece myself, but then scanning it onto the computer, and then seeing it like that, and then getting it again, is definitely a cool feeling. Because you’re like shit, this is like, legit. It’s definitely a cool experience.\n\n\nYou said that you are drawn to skateboarding and its culture because there are 'no rules'. how does this outlook on skateboarding translate into the way you create?\nWith art? Yeah, definitely, it's all the same. I came into doing art without any structure or any learnt skills or anything. For me it's the same as skating and you just kind of jump on the board, do your thing and just hope for the best.\n\nWhobokku\nWhat first got you into skating?\nShit, my neighbour, when I was a kid we had a little skate crew called the Street Rats. We used to just run around the streets, trying to ollie up curbs, drawing on our grip tape and shit, that’s where it all started.\n\n\nFrom the designs on decks, the stickers everyone puts up, to the clothes, skateboarding is an art form in itself. Do you see skateboarding as another avenue for you to express yourself creatively?\nYeah. 100%, I see skateboarding kind of like dancing, just going out there, learning new tricks, doing these little moves and jigs and stuff. It's my physical creative outlet, painting and art is more of my mental outlet.\n\n\nYou've done murals, mixed media pieces, photographs, paintings, mini-sculptures, and much more. Do you have a favourite artistic medium?\nAh, definitely sketching, just like sitting there drawing with a pencil on a pad like, that's the most calming kind of thing for me.\n\nWhobokku\nI know you've tattoo'd yourself and you like tattooing, what first got you to start?\nI mean shit, skating too, as a kid you look up to all these pro skaters and most of them are covered head to toe, it's kind of part of the whole thing I guess. I see it as art as well, so it’s just a mixture of all the shit I like.\n\n\nDo you have a favourite tattoo?\nOn me? Definitely Ging, this one right here, it’s a stick and poke done by Simple Hands. Ging is this anime dude who I feel like represents skating because he gets beat almost to death every episode, but then next episode he's ready to go back at it.\n\nWhobokku ging\nWhat creatives, regardless of their artistic medium, inspire you?\nThere’s so many, Tyler the Creator, he’s a big one because he's just full on being himself, just doing his thing, whatever he wants to do he just kind of does it, so that’s definitely super inspiring to me.\n\nDo you listen to a lot of music?\nYeah I do, I used to make beats and DJ quite a bit, I’ve actually got an EP, it’s kind of weird, I used a text to speech bot and made this AI complaining about the end of the world, saying shit like, \"we fucked up\" and all this shit about the world ending, so I might release that. Maybe as Whobokku, just like a visual kind of video thing, who knows.\n\nWhat have you done that you are most proud of?\nShit, I don’t know, that one’s hard. Probably the sweet back side flip I landed the other day, it was pretty fun. The Bad Olive stuff was really cool too, that whole experience. Abby just hit up a bunch of Brisbane creatives, similar to what you guys are doing, and then put on a big event for us. She just made us feel special and gave us fucking catering and shit and all this unneeded stuff for our level but yeah, it was just a cool experience for sure.\n\nwhobokku\n\nWhat led you to make the hot sauce?\nMy uncle, he makes sauces and honey, he's just a super farm kind of dude. Yeah, we were growing heaps of habaneros and I don't know, I love the show hot ones and thought i’d just make a hot sauce.\n\nWhat other Brisbane-based creatives do you think. are pushing the boundaries and deserve to be recognised?\nThere's a ton of Brisbane artists that are super creative and really getting into it with music, art, everything. There’s way too many to name. The homie Blue the Magi, he's a sick rapper. He does a lot of improv jazzy kind of stuff and shit. There's so many. Everyone who I put on my show. Shit. I feel like I missed so many out.\n\nwhobokku\n\nWhat are your goals or hopes for the creative Brisbane community in the future?\nI think that we just work together, my main hesitant apprehension or whatever is that things will get too cliquey, like everyone just doing their own shit. But yeh just mainly for everyone to work together and help each other out.\n\nWhat advice do you have to young creatives who are just getting started, regardless of their medium?\nJust make shit, do as much as you can, whatever you feel like. But make make sure you're actually doing, it's sick to think about something and have an idea but you gotta execute. You have to at least try it to see if it'll actually work. And yeah, just do it. I guess. Like Nike.\n\nWhobokku\n\nIf you could have 5 guests at an imaginary dinner party, dead or alive, who would it be?\nShit I don't know. Would it be someone to converse with, or someone that’s gonna cook me a mad dinner.\n\nDinner is provided.\nAlright, five people, shit. I mean, Nikola Tesla, right? See what the fuck is going on there. Probably Bowie. Nikola Tesla and Bowie. Those two would be the best, they’re the ones I would ask a lot of questions. Andy Warhol, maybe.\n\nAny skaters on the list?\nOh, true, I didn’t even think of skaters. Who would I like to party with? Dustin Dollin for sure, Dylan Rieder, rest in peace, we'll just say Harold Hunter too. That’d be a fun dinner party.\n\nWhat's next for you?\nComing up next, I don’t have any shows locked in but I’m doing a thing with Parliament which I don't want to say too much about. It’s a little capsule collection, so that’s cool, and yeah, just gonna keep pushing the art and trying to evolve and get better and then and keep it moving.\n\nPhotography credit: Oliver Nijimbere\n\n\nContinue to support and be inspired by creatives all around Australia at Sweet Talk, and if you want to see more content from the people that brought you this interview, check out Candy .\n",
            "author": "Gabriel Mungarietta",
            "date": "2022-07-07T00:00:00Z"
        }, {
            "title": "Spencer Lees",
            "header": "Inside the mind of Brisbane fasion dedigner Spencer Lees",
            "thumbnail": "spencer_thumb.jpg",
            "body": "Spencer Lees is a Brisbane-based fashion designer with a unique style stemming from his love for exploration. He is currently a fashion student at QUT, where he plans to complete his university course and after graduating, start his very own fashion brand. As a child playing basketball and skating with his brothers, to now designing and making high-end fashion pieces, Spencer has no plans on stopping until he's at the very top.\n\nWe sat down with him to talk about his introduction into fashion, his love for abandoned buildings, and what he's got coming up. \n\n\nCould you introduce yourself for people that don’t know you?\nMy name is Spencer Kahu Lees and I’m a third year fashion design student. I’m currently interning for a brand on the Gold Coast called Bouquet Studios. And yeah, that that's pretty much what I do.\n\n\nWhere are we, could you give us a rundown on this space?\nWe are at the fashion design studios here at QUT Kelvin Grove. It's pretty much where I do my uni work and yeh, complete my degree. It's got everything, I gave you guys a little tour earlier. Yeah, it's perfect. It gets pretty hectic, you never really find it empty like this, so it's kind of the perfect day for this.\n\nSpencerLeesStudio\n\nWhat first sparked your interest in fashion?\nI think back in Year 10, I started caring more about what I wore, before then it was kind of just City Beach and Stussy stuff. And then I kinda got into watching PAQ, watching interviews and challenges and all that stuff. That was sick, and then I started branching off, I got obsessed with ASAP Rocky and those bright camo pants, like the cringy stuff. So I bought a pair of those, and realised, ok, I’m into fashion. I was never really into the high-end stuff just because I couldn’t really afford it. From there, it just kinda snowballed. I started taking a lot of cringy IG photos, and that was kinda my entry into the fashion world. \n\nWhen I was completing Year 12, I started thinking about what I wanted to do. Like, where am I going with this? Plan A was to go to America and play basketball. I did a tour over in Chicago for abit, but I started to realise that my love for it was kinda lost. And especially over there, it's kill or be killed mentality. Halfway through Year 12, I talked to our student leader, and he introduced me to the idea of studying fashion design at uni. At that point, I’d never heard of that. I was really interested and he told me it would be good to get industry experience, so he hooked me up with this Brisbane brand Dogstar. I worked there for a week, like 9-5. Since then, I realised, this is what I want to do. \n\nI think the turning point was, coming from that jock mentality, to then transitioning into a workplace where it was all older woman and I still felt like comfortable and enjoyed it. That was kind of eye opening for me. That’s when I realised I had a passion for fashion.\n\nHow has your personal life, whether it be childhood or now, influenced the way you create and your style?\nA lot of my childhood was basketball and skateboarding. I was really into skating and the whole culture. If I wasn't playing basketball, I was at the skate park. And skate culture, it has such a defined aesthetic. It all kinda intertwines, music and skating, it all has a common ground of fashion. I’d say that creatively, at the moment my style is heading a bit more to the skater aesthetic with the baggy jeans and hoodies. \n\nAt the beginning of my degree, I was really just trying to find myself, and I was making all kinds of different stuff. But then, as time passes, you start listening to different music and doing different things, and all of a sudden you don’t like that piece you made 2 months ago. My style is a constant transition. But yeah, I wouldn't say my childhood influenced me too much, I'd say it would be more about what I'm doing now, I  like to explore a lot of abandoned buildings, me and my brothers are really into graffiti and that type of stuff. I really like that idea of exploration meets streetwear aesthetic, where it's not street wear, but it's not the whole gorpcore trend going on. I'm trying to find a balance where my pieces are still appealing to the streetwear market, but they’re also appealing to the people who want to push the boundaries.\n\nSpencerLeesQUT\n\nWhat music do you listen to and do you think it shapes your creativity or style?\nMusic definitely shapes a lot of what I do. In high school, it was a lot of ASAP Rocky and Uzi, really what everyone was listening to. As I transitioned out of high school and became as bit more independent, I started listening to bands like Nirvana and Soundgarden, a lot of 90s grunge type music. It kinda kept on snowballing to the point where I was really into the rocker aesthetic. I only wore old raggedy stuff, had long hair and didn't want any brands on me, I wanted to be super alternative. \n\nNow it's kind of transitioned into Eminem, Linkin Park, it’s still a bit heavier stuff, but it’s got some street/rap influence. It's weird to see my work in different semesters, in the beginning, I made more Gothic type clothes, and that was around the time I was listening to Marilyn Manson, not really screamo music but very heavy. Now it's kind of transitioned back to where it started with more 2000’s rap. \n\nBut yeh, I listen to alot of Linkin Park, Limp Bizkit and Eminem.\n\nWhat was it like to grow up with brothers?\nI have two brothers, who are my best friends, Ethan and Bailey. We're all around two years apart. I'm 20, my younger brother’s 18, and then my youngest brother is 17. We're all around the same size so we all wear the same clothes. I think the brother camaraderie, that was my childhood. We all played sports together, skated together and went to the same high school parties. They have been around me my whole life. Every time I did something like explore abandoned buildings, get into graffiti, it’s was always with them. I feel that, if anything, they have had a huge influence on my designs. Not as a muse, but every time I've had a creative or enlightening experience, it's always been by their side.\n\nSpencerLees\nIs there a particular place where you feel most creative?\nIn terms of a place, I'd say an abandoned building. Like I said me and my brothers like to explore stuff. We love everything about it, you kinda get dressed for the occasion as-well, like work-wear, thick jackets and stuff. And when I see a destroyed wall, and you can see all the different colours or all the different crumblings of the wood or the rocks. And you sift through it, and you see a coin or something lying on the floor. I really like that idea of layers and complexity. What you see is not not always what you get. I feel like with a lot of menswear at the moment, what you see is what you get, kinda like this white knit sweater I’m wearing now, whereas I was trying to, especially in the beginning, trying to create different fastenings, where you’d roll up the sleeve, and there’s hooks there. That’s what I mean by layers and complexity. When I think of exploring a building, I think of denim, and oversized hoodies, and that’s really inspired my overall aesthetic. My final collection this year is actually based off of abandoned buildings, and this idea of the transition from a functioning building to then a destroyed building, and how in society, an abandoned building has no purpose, but to someone like me or my bothers, that’s our perfect Friday night. \n\nIn terms of other style inspirations, I look to a lot of music videos. Sometimes I’ll just search 90s heavy metal music videos on YouTube, and I'll just like watch through a whole playlist of them. As I watch I’ll keep pausing and noticing certain things like spiky things hanging off a drum kit of something, and then I’ll draw that spike and look for ways to integrate that into a clothing piece. In the 90s everything was so diverse, you could flick through 20 different music videos and they would all look completely different.\n\n\nWhat is your creative process when making a clothing item?\nDamn, It kind of changes every time. Sometimes, I'll do the whole like music video thing. I've never been into the whole Pinterest mood board thing, I think I need a lot of video stimulus. Even sounds as well, I’ll just put headphones in and hear a really hectic beat, and I’ll make something more aggressive. I have this little a5 book that I either keep in my backpack or or just carry with me, I do a lot of sketching. I don't necessarily always draw a full look, sometimes I'll just draw like a spiked collar I thought of on the go. Or I'll just be in the shower, and come up with something like studs on a hoodie and then I'll just quickly get into my notes on my phone, and just write the idea down. Then, when I have time to draw it out, I’ll draw five, six iterations, sometimes it'll be the first one and it’s perfect, other times, I won’t get it right for a while. \n\nUsually, it's pretty quick in terms of the design, once the design is done, you do it up. And then here at the fashion studios we have the pattern blocks that have all the basic silhouettes, and we just manipulate it to fit our design. I usually go through about two to three toile’s, the first one is just the body or the sleeves, just to get an overall shape, then I'll do the second one with a collar. Finally, the last one is pretty much just getting it perfect. After that I just go straight into the final fabric. \n\nI also spend a lot of time just visiting a fabric store and just touching different fabrics, and there’ll be some materials where I just get really inspired and can kind of see the final product. For example I’ll see a material and think, this would look good in a baggy pant, or tailored.\n\nMy creative process is really random, I can’t really pinpoint it. One tip I have for other fashion designers, is that I always sketch in pen, so I can't erase it. Just because you’ll find that even when you think you made a mistake, a lot of the time’s it isn’t actually. For example, if you accidentally draw a curve out when you wanted it to be straight, when you finish the drawing, you see that little curve and think to yourself, maybe the piece could have a bit of shape and it end’s up staying there and changes the design. I don't know, it just works for me. That’s a little tip I just dropped.\n\nSpencerLeesSketching\nWhat is your favourite part of the process?\nMaking the final garment for sure. I usually make my prototype and then I'll pick the final fabric, definitely my favourite part is when you've got your pattern, so you know everything works, and you can just take your time cutting it out and just making it perfect. The first time that you try it on as well, there’s no better feeling, especially when it fits nice.\n\n\nI know a lot of artists face creative blocks, how do you get through them?\nYeah, this is this is a tricky one. I'm working on a full look right now, so we have to have three aspects of the look. So for example a jacket, pant, top or a pant, jacket and accessory. I'm kind of stuck on designing this coat right now, so what I'll do is put it to the back of my mind, do the pant, and then just build off it like that, especially when you're doing full looks. When you're doing looks, you can't just have a cool jacket and the rest of the outfit be whack. So if I'm having a creative block on one aspect of the garment, or even one particular sleeve or something, I'll like put it aside and work on another piece of the outfit, and kinda just build of that. Yeah, that's kind of how I get through it, I guess.\n\nSpencerLees\nWhat creatives, not in the fashion industry, have inspired you?\nI think my biggest inspiration is probably Linkin Park, just because for me, they've got the perfect blend between street wear and still looking edgy as hell. I really like that idea. With my clothes, I don't want to look super edgy to the point where everything's a statement piece, but I also don't want to look like I'm just wearing your casual Brisbane streetwear fit.\n\nAnother one is probably Marilyn Manson, I was heavily into the whole Gothic, one contact lens thing. The mini collection that I did last semester was actually heavily influenced by a lot of his music videos and how they're all scary and their bodies are really elongated. \n\nYeah, it's always been music, I don't look to fashion muses anymore. I used to be into ASAP Rocky, but I've never looked at him and thought to myself that he’s influenced my style. It's more that I’ll hear the music and like the attitude, volume and the energy I get from that. I feel like that is probably represented most in my designs.\n\n\nOn your instagram you have photos of the clothing pieces you’ve made, some graphics you designed, as well as some of your typography work, is there a central theme that ties all your art together?\nI think dystopian is one for sure, but not neo-punk, matrix dystopian but more like this idea of destruction. A lot of my graphic work, it’s kind of grungy and it's not perfect. A lot of graphics now, they are really minimal and clean and have a lot of breathable whitespace and stuff like that. I feel like when I’m working on my graphic designs, I just throw stuff in there, and then I'll just slowly start taking stuff away. This way of creating has been relevant in all creative aspects of what I do. When I get really excited and I start drawing a shirt with like 20,000 different little details or something, I have to look at the cohesiveness and the functionality of the piece, and then slowly peel it back and simplify it. But yeah, in terms of one word that kind of summarises everything, I'd say dystopian is the idea that represents everything.\n\nSpencerLees\n\nOn your tik tok you said you wanted to start a podcast about fashion and eventually branch out to other creatives, how important is it for you to surround yourself with people of all different creative avenues?\nEspecially in Brisbane, where I feel like we aren't as known for creative endeavours, when I meet someone creative, or someone trying to do something, I just get so much euphoria. I really appreciate someone who has passion for what they do, and me being passionate about fashion, when I see someone, like you guys with your production company, I didn't even hesitate to work with you guys. Especially in the creative world, a lot of connections is everything, and everyone knows this. I feel like that's a huge part of why we want to collaborate with other creators. I know this is a cliche one, but like Virgil Abloh, he was one of the first people to just be like everyone is in this together, everyone can eat, it’s not a competition. That’s a big inspiration behind my Instagram, how I'm not afraid to put my designs out there. He was all about everyone being together, there's no exclusivity. If we want to keep building the Australian creative scene, everyone’s got to work together. This mentality that if you post, your designs are gonna get stolen, it’s not good because then how are you going to showcase your talents and get it out in the world. It's like how you guys hit me up, you saw my stuff and asked to interview me, if I hadn’t posted my stuff for people to see, that wouldn’t of happened. I kind of forgot the question hahah, just went off on a bit of a rant. \n\nI think I noticed this more than ever when I went to intern for Bouquet studios, because the owner is very connected. Not just in fashion, but he knows heaps of DJs and we've been throwing some event parties to promote his brand, and a bunch of dj’s come up and just do a set for free, just cause he knows them. It just shows that if you look after each other there's always going to be that exchange of favours. \n\nI find sometimes it can get lonely pretty quick, only if you make it lonely. If you’re constantly on your grind, or in the fashion studio until 2am, it can get lonely, but when you’re in here with 5,6,7 different people and you don't even need to be talking, just headphones in and you see the energy and how everyone is trying really hard to get things done, you can just build off that. It's just the creative energy you can't really get from anything else in life really.\n\n\nYou have the brand Slash N Sew Goods, where you resell clothes you’ve thrifted, can you tell us more about that?\nIt's funny actually, I had a graphic design assignment last year, and we had to make a logo for a brand that we had come up with. They gave me a task sheet with a bunch of stimulus, and one of them was a record label. I thought to myself, cool, I'm into music, I'll pick that. That’s pretty much it, I made a brand called Slash Records, and the logo I made was the skull logo I ended up using for Slash N Sew. It just kind of hit me one day, that I really loved the logo. So that’s where the Slash and the logo came from. In terms of how I actually got into the business, I’ve always been on Depop just looking at stuff. Only because I didn’t have a job, but I still wanted to dress in brands, but I didn't want to pay the full price. \n\nThen one day, in the middle end of 2020, I was sort of getting into thrifting just because thrift shops were the only stores open during covid. Me and my mate were out skating, and I was wearing shorts, and I fell and cut myself. I just thought to myself, I'm just gonna go into the thrift shop and get a cheap pair of jeans. I ended up getting some vintage billabong jeans, and this was in some random thrift shop, far from the city, and I paid like $4 for them. In my mind, I was thinking , I've got this part time job, how can I make money without over-exerting too much energy, and taking away from my fashion.\n\nIt kinda sparked then, I thought to myself, I could just go to the thrifts, get 10 things, upload them to depop and then just over time they’ll slowly make money for me. There is a bit of work involved but it's not like you have to go to an 8 hour shift. And yeh, it’s doing pretty awesome, I've slowly built it up, it pulls in about four figures a month now. It makes nearly as much as my part time job and I'm doing what I love. \n\nThe business side of things too, there’s something about having a business and having all the control over it, I really like that. It's taught me a lot about sales and fashion as well, just little things that, that if you're not running your own business, you just wouldn’t learn. When I eventually start my brand, hopefully next year, I’ll have a way better understanding of the logistics and how to actually run the business side of things. I think it's been extremely beneficial.\n\nSpencerLees\nRecently, I saw you went around wheatpasting poster’s up at 3 am, and you also have photos of you tagging some walls. What is it about street art that attracts you?\nThere's so much about it, it's not like traditional art where everyone’s in suits staring at a wall and thinking, oh, this is so fancy. I just really like the realness of it, that’s the best way I can describe it. I like how it’s aggressive, and a bit rebellious because, obviously, it's generally illegal. I don't even know how to describe it. It's just this idea that you're taking a risk, but you're risking it for the euphoria you get off having a cool tag or whatever. There's little things in it that I like, when I see a wall and it looks cool from a far, but when when you get up close you see all the little textures and the grains in the wall. Little things like that, you just can’t get on a painting or a fine art piece or even digital. I really like the layers to it as well, there'll be 10 different tags on top of each other and if you looked at this wall five years ago, maybe three of them were there, and then in 10 years, there's going to be 30. I don’t know really, something about that concept is really intriguing to me. \n\nI feel like it's all about building the aesthetic as well, I post a lot about it because my brand has a bit of street influence. The wheat-pasting stuff was for the brand Bouquet, and that was really fun, we hit a couple red hot spots so we had to be quick. \n\nIt’s stuff like that, that you’re not going to get at a regular internship, he's really taken me under his wing. He told me, I'll help you as much as you help me, I'm not gonna just get you packaging orders all day. I was onboard from the jump. Back to the street art, it just creates this aesthetic that people can buy into. A lot of fashion cultures and niche markets come from the streets too. Especially with my brothers, we were always skating and exploring, so the streets just feel like, I'm not saying the streets like I'm from the hood or whatever, but the streets just feel like second nature.\n\nDo you have any graffiti inspirations?\nHonestly, my brother, he's really getting into it. He's really trying to push this thing and I think one day he’s going to be really hectic at it. He's always been a good drawer, and he loves to take risks, It's perfect for him. He's been working on his tags, he's got a tag, Euro. E U R O. He's coming up for sure.\n\nI know you’ve said you struggled abit to find your identity. Do you think your art and being creative was an avenue that helped you find that identity?\nYeh that was definitely a hard thing for me. In high school, I was someone who just kinda fit into the traditional jock or sports guy role. Like just wearing Nike, and just listening to whatever was popular at the time. I had one set of earrings and it was always studs, it was never rings. Then when I kinda started listening to different music, it really helped me and it gave me a new confidence. I just thought to myself, if these artists can do it to this extreme level, then I can kind of slowly work my way into it. Then all of a sudden I started wearing like one ring, and then I got my seconds done, and then I got my helix done and it kind of just kept on building. I'm at a stage now where I'm pretty much confident to do whatever, and I feel especially being in fashion, you come in and see all these incredible people wearing all these bold statements and no one's afraid. \n\nBeing in high school, there's all the judgment, there's like the whole social media thing. I think everyone's walking on their tippy toes, trying not to look like an idiot, but I feel like you'll find, when you're that age, you might think everyone cares, but they’re just focusing on themselves. Once I realised that, I thought to myself, I may as well just look how I want to look. I'm not saying I'm this crazy out there guy, but it’s just little things that I wouldn't have done in the past. You just have to learn to be proud of who you are and to work with what you got. \n\nMusic definitely helped me realise that, and just being in environments where people aren't afraid to try new things. Instead of high school, sitting with all your mates, and they just all want to listen to drill music hahah.\n\nSpencerLees\n\nWhat other Brisbane-based creatives do you think are pushing the boundaries and  deserve to be recognised?\nYou guys for sure, shout out to Candy. It’s really dope, you're making everything really professional which is sick. I really appreciate this, it's awesome getting interviewed, makes you feel like you're doing something good. It's like a great feeling. \n\nA few of my mates from my uni degree. Michael Shin, he's a good friend of mine, and he's kind of taking me under his wing, he’s been designing for a little bit longer. AJ as well, like the guys doing the Praema show, he also kinda took me under his wing. I kind of met him last year and we've been close ever since. He's been really helping me out. \n\nI don't even know, there’s so many people. The guy I intern for, his brand’s up next, he's onto something. His party’s are crazy, they’re selling out warehouse parties. He's nailed his aesthetic. I feel like he's onto something. \n\nIt's too many people to say and I don't want to forget anyone. The Brisbane scene is definitely on the come up. Even if we move out of Brisbane, I feel like a lot of people are a lot more proud to say they’re a Brisbane creative now. Brisbane is where it’s at, people bash it but it's coming up, people need to start showing more respect.\n\nWhat are your goals or ambitions for the next five years?\nIn a perfect world, man, I'd want to be definitely somewhere like New York or London, I feel like those two are just places I want to be. I want to be well traveled by then, not like go on a holiday and muck around, but I want to meet different people and go to different fashion weeks. I want to obviously have started my brand, I'm hoping to do that next year. I feel like this idea that I'm trying to create, that people's opinions are valued and that I’m not afraid to just show people stuff. I want to create this idea of inclusivity, I feel like that’s going to help me with my brand in the next five years. But yeah, definitely start my brand, be overseas, and I just want my own studio. \n\nI want to be at the level where I'll get a DM from someone who wants to work with me, and we have a space to do that. I just want to get to that level where there's no like hesitation to hit me up and be like, yo, let's do something, and there's no like, oh, I'm not too free, because I'm working my part time job. I think, that idea is really attractive to me. Like if you guys want to pull up and film something, I'll just be like, yeh, sweet. Let's do it, and I don't have to clear a schedule, and I don't have to go make space or whatever. That would be like the perfect working environment. In five years I'll be 25 so that 20-25 period is going to be a great experience and I'm really excited for it. I'm pretty optimistic too. \n\nI've always been like really driven, but to the point that it can fault me sometimes because I’ll think I always have to be doing something, like I can't just not do something. I feel like Depop really filled that void for me. I like this idea that you work better with deadlines and you have this constant pressure, I kind of want to take that into next year and not think that just because i’ve graduated uni, I can just relax. I feel like taking that mentality into next year will be like huge.\n\nSpencerLees\n\nWhat advice do you have to young creatives who are just getting started, regardless of their medium?\nFirst of all, i'm not saying be this crazy extroverted person because I'm actually kind of introverted, but if you get little opportunities, even a small production company or a small agency or something that you might think it's not going to be worth it. Just show up, meet one person and that one person could link up with you, get you an interview, which then might be seen by somebody. You just gotta keep building and getting out there. In the beginning, I'd come in with my headphones in, not talk to anyone, hand in my assignment, and then leave. I just thought to myself, nah man, what are you doing? Meet these people, these people are gonna be huge one day. It’s not like you have to meet them just for your benefit, I think it's like this mutual bond where you want to grow your circle and your network of similar people. You want to get to the point where you're both giving each other an even exchange. I've learnt that just fairly recently, networking is huge, but those even exchanges are even bigger. Don't be afraid to put yourself out there, that’s how I got my internship, I just found his email link in his Instagram bio, and I sent him everything I've ever done, He got back to me within a day, and it's been the greatest experience. All just because I wasn’t scared to reach out. Especially in creative industries, I don't want to say it's who you know, because anyone can make it, but it makes it a lot easier when you're getting yourself out there. \n\nGetting more specific to fashion, speaking from my perspective, the fashion industry is very cutthroat. If you work hard, it will reward you, but if you don't, you will get left behind. If you want to get into fashion, make a commitment to not only yourself but you’ll also have to sacrifice a lot, like a social life. You need to realise, it never stops, there is always something happening. There's always stuff to do. Even when you’re in the shower you're thinking of new designs. It’s good for someone like me because I love it, it's taken over my life and it's no longer a course or a job, it’s just fashion, it’s just what I love doing. I've seen a lot of people in their first year that get here and they're incredibly talented, but they just don't want to come in on the weekends, or they just don't want to stay after class to make the garment just a little bit nicer. It’s all in the mentality.\n\nJust prepare yourself, it is hectic and just as much as it takes out of you physically, it will take out of you mentally and emotionally. If you're into it as much as a lot of us are, you’ll do awesome, but if not, you’ll find something else, just keep working and it’ll come.\n\nIf you could have 5 guests at an imaginary dinner party, dead or alive, who would it be?\nFirst of all, would probably have to be Kurt Cobain. Just because he was my transition from mainstream rap into the kind of music that I really liked. I think he's one of the most talented people of all time, so I'd love to meet him. \n\nDamn this is so hard, there’s just so many people out there. Definitely Eminem, he’s probably one of my favourite artists of all time. At this point it’s just people I’d love to meet. \n\nThird would have to be Demna Gvasalia from Balenciaga. The way he can make streetwear look designer, it's just insane. \n\nThat’s a weird group of people.\n\nFourth would probably be Marilyn Manson. I find it so crazy how he was so controversial , he should be canceled 50,000 times over but he made it. And he made it just through hard work because, let’s be real, he doesn't have a beautiful singing voice.\n\nLastly, just everyone from Linkin Park. We'll just make them count as one because they're my favourite group.\n\nSo yeh, that’s five, Kurt Cobain, Eminem, Demnar, Marylin Manson, and all of Linkin Park. That would be a weird dinner.\n\nSpencerLees\n\nWhat's next for you?\nSo coming up for me, I’m one of the runway models for the Praema show, which is really sick, it’s my first time walking in a runway show. Then in August I’m heading down to Melbourne for the brand I intern for, we're doing a three day pop up shop, and then hosting party events at night. Really keen for that. That stuff is all pretty soon, and then at the end of the year I've got my six outfit runway collection for my capstone graduate collection. That will be hectic, I'm not dreading it, but it's a lot to do, but, I love it, and I'd do it 10 times over. \n\nThen I guess next year I want to start my brand. I’ve had people come up to me and say they really like the clothes I make, and I feel like I'm in this nice grey area where its both commercial but also creative. It can be both sold on a shelf, but it’s also pushing enough boundaries to where it’s not regular stuff, which I think is dope. Coming from someone who doesn't want to go work for someone else, but wants to start their own brand, I always have to have this idea of commercial appeal, whilst also trying to create clothes that I love, because at the end of the day, that’s why I do it. \n\nBut yeh, we’ll see how it goes from now. I try to take it six months at a time. Don't try and think too far ahead. But yeah, I guess that's where we're heading.\n\nPhotography credit: Oliver Nijimbere\n\n\nContinue to support and be inspired by creatives all around Australia at Sweet Talk, and if you want to see more content from the people that brought you this interview, check out Candy .\n\n   \n",
            "author": "Gabriel Mungarietta",
            "date": "2022-11-06T00:00:00.000Z"
        }]
    }
}